Verified on devnet `1.8.1-dev`

Now gateway nodes are validated before sending the deployment.


```bash
mohamed@mohamed-Inspiron-3576:~/Desktop/Threefold Repos/terraform-provider-grid/terraform-provider-grid/examples/resources/taiga$ terraform init && terraform apply

Initializing the backend...

Initializing provider plugins...
- Finding threefoldtech/grid versions matching "1.8.1-dev"...
- Installing threefoldtech/grid v1.8.1-dev...
- Installed threefoldtech/grid v1.8.1-dev (self-signed, key ID 77AB02E5CA9698A3)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.grid_gateway_domain.domain: Reading...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # grid_network.net2 will be created
  + resource "grid_network" "net2" {
      + access_wg_config   = (known after apply)
      + add_wg_access      = true
      + description        = "newer network"
      + external_ip        = (known after apply)
      + external_sk        = (known after apply)
      + id                 = (known after apply)
      + ip_range           = "10.1.0.0/16"
      + name               = "grid3taiga"
      + node_deployment_id = (known after apply)
      + nodes              = [
          + 31,
        ]
      + nodes_ip_range     = (known after apply)
      + public_node_id     = (known after apply)
      + solution_type      = "Taiga"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: couldn't get node 31 public config: no public configuration
│ 
│   with data.grid_gateway_domain.domain,
│   on main.tf line 68, in data "grid_gateway_domain" "domain":
│   68: data "grid_gateway_domain" "domain" {
│ 
╵
```

![image](https://user-images.githubusercontent.com/101194226/231437035-76bcf226-43c3-4c14-8bec-06588eae0312.png)
